{
  "name": "projects/1017425675889/locations/europe-west3/instances/a099fd02-80fc-4a0f-a80c-fb5d7fe78564/rules/ru_7e1e9e04-badf-446f-b9a4-be2cee3f306f",
  "revisionId": "v_1740553368_899535000",
  "displayName": "win_password_spray_1",
  "text": "rule win_password_spray_1 {\n meta:\n   author = \"Chronicle Security\"\n   description = \"Detect repeated authentication failure with multiple users indicative of a password spray attack.\"\n   severity = \"Low\"\n events:\n   $event.metadata.event_type      = \"USER_LOGIN\"\n   $event.metadata.vendor_name     = \"Microsoft\"\n   $event.principal.hostname       = $principalHost\n   $event.target.user.userid       = $targetUser\n   $event.security_result.action   = \"BLOCK\"\n match:\n   $principalHost over 30m\n\n outcome:\n   $risk_score = max(50)\n   $target_user_distinct_count = count_distinct($targetUser)\n   $target_user_count = count($targetUser)\n   $target_users_uniq_list = array_distinct($targetUser)\n   $tlp = array_distinct(\"amber\")\n condition:\n   #targetUser > 10\n}\n",
  "author": "Chronicle Security",
  "severity": {
    "displayName": "Low"
  },
  "metadata": {
    "description": "Detect repeated authentication failure with multiple users indicative of a password spray attack."
  },
  "createTime": "2025-02-24T12:55:05.453183Z",
  "revisionCreateTime": "2025-02-26T07:02:48.899535Z",
  "compilationState": "SUCCEEDED",
  "type": "MULTI_EVENT",
  "allowedRunFrequencies": [
    "LIVE",
    "HOURLY",
    "DAILY"
  ],
  "etag": "CJj5+r0GEJih96wD",
  "inputsUsed": {
    "usesUdm": true
  }
}