{
  "name": "projects/1017425675889/locations/europe-west3/instances/a099fd02-80fc-4a0f-a80c-fb5d7fe78564/rules/ru_b7c9ebd3-1814-4a5c-85b1-2ac3358384d4",
  "revisionId": "v_1716806379_407823000",
  "displayName": "rw_windows_password_spray_T1110_003",
  "text": "rule rw_windows_password_spray_T1110_003 {\n\n  meta:\n    author = \"Google Cloud Security\"\n    description = \"Detect repeated authentication failure with multiple users indicative of a password spray attack.\"\n    type = \"alert\"\n    data_source = \"microsoft windows events\"\n    mitre_attack_tactic = \"Credential Access\"\n    mitre_attack_technique = \"Brute Force: Password Spraying\"\n    mitre_attack_url = \"https://attack.mitre.org/techniques/T1110/003/\"\n    mitre_attack_version = \"v13.1\"\n    platform = \"Windows\"\n    severity = \"Medium\"\n    priority = \"Medium\"\n\n  events:\n    $login.metadata.event_type = \"USER_LOGIN\"\n    $login.metadata.vendor_name = \"Microsoft\"\n    $login.principal.hostname = $hostname\n    $login.target.user.userid = $user\n    $login.security_result.action = \"BLOCK\"\n\n  match:\n    $hostname over 30m\n\n  outcome:\n    $risk_score = max(65)\n    $mitre_attack_tactic = \"Credential Access\"\n    $mitre_attack_technique = \"Brute Force: Password Spraying\"\n    $mitre_attack_technique_id = \"T1110.003\"\n    $event_count = count_distinct($login.metadata.id)\n    $user_login_threshold = max(10)\n    $target_user_distinct_count = count_distinct($user)\n    $target_user_count = count($user)\n    $tlp = array_distinct(\"amber\")\n    // added to populate alert graph with additional context\n    // Commented out principal.hostname because it is already represented in graph as match variable. If match changes, can uncomment to add to results\n    //$principal_hostname = array_distinct($login.principal.hostname)\n    $principal_ip = array_distinct($login.principal.ip)\n    $target_hostname = array_distinct($login.target.hostname)\n    $src_hostname = array_distinct($login.src.hostname)\n    $target_ip = array_distinct($login.target.ip)\n    $principal_user_userid = array_distinct($login.principal.user.userid)\n    $target_user_userid = array_distinct($login.target.user.userid)\n    $principal_resource_name = array_distinct($login.principal.resource.name)\n    $target_resource_name = array_distinct($login.target.resource.name)\n    $target_url = array_distinct($login.target.url)\n \n  condition:\n    #user > 10\n}\n",
  "author": "Google Cloud Security",
  "severity": {
    "displayName": "Medium"
  },
  "metadata": {
    "mitre_attack_tactic": "Credential Access",
    "mitre_attack_url": "https://attack.mitre.org/techniques/T1110/003/",
    "platform": "Windows",
    "description": "Detect repeated authentication failure with multiple users indicative of a password spray attack.",
    "data_source": "microsoft windows events",
    "mitre_attack_version": "v13.1",
    "mitre_attack_technique": "Brute Force: Password Spraying",
    "priority": "Medium",
    "type": "alert"
  },
  "createTime": "2024-05-27T10:39:39.407823Z",
  "revisionCreateTime": "2024-05-27T10:39:39.407823Z",
  "compilationState": "SUCCEEDED",
  "type": "MULTI_EVENT",
  "allowedRunFrequencies": [
    "LIVE",
    "HOURLY",
    "DAILY"
  ],
  "etag": "COvF0bIGEJjFu8IB",
  "inputsUsed": {
    "usesUdm": true
  }
}