{
  "name": "projects/1017425675889/locations/europe-west3/instances/a099fd02-80fc-4a0f-a80c-fb5d7fe78564/rules/ru_c01d0db6-073b-47c7-b983-4067af9d3bfc",
  "revisionId": "v_1721022466_523215000",
  "displayName": "ioc_sha256_hash_vt",
  "text": "rule ioc_sha256_hash_vt {\n \n  meta:\n    author = \"Google Cloud Security\"\n    description = \"Detect file/process events with watchlisted hashes from MISP that VT flagged as MS Office docx file types\"\n    type = \"alert\"\n    tags = \"threat indicators, vt enrichment\"\n    assumption = \"Assumes MISP data has been ingested into entity graph; this rule can be modified to utilize other TI indicators\"\n    data_source = \"microsoft sysmon\"\n    severity = \"Medium\"\n    priority = \"Medium\"\n \n  events:\n    $process.metadata.event_type = \"PROCESS_LAUNCH\" or $process.metadata.event_type =\"FILE_CREATION\"\n    $process.principal.hostname = $hostname\n    $process.target.process.file.sha256 != \"\"\n    $process.target.process.file.sha256 = $sha256\n    // Enriched field from VirusTotal integration, can be commented out or modified if not using\n    $process.target.process.file.file_type = \"FILE_TYPE_DOCX\"\n \n    // Correlates with MISP data; can be modified based on your MISP parser or other TI \n    $ioc.graph.metadata.product_name = \"MISP\"\n    $ioc.graph.metadata.entity_type = \"FILE\"\n    $ioc.graph.metadata.source_type = \"ENTITY_CONTEXT\"\n    $ioc.graph.entity.file.sha256 = $sha256\n \n  match:\n    $hostname over 15m\n\n  outcome:\n    $risk_score = max(65)\n    $event_count = count_distinct($process.metadata.id)\n    // added to populate alert graph with additional context\n    // Commented out principal.hostname because it is already represented in graph as match variable. If match changes, can uncomment to add to results\n    //$principal_hostname = array_distinct($process.principal.hostname)\n    $principal_process_pid = array_distinct($process.principal.process.pid)\n    $principal_process_command_line = array_distinct($process.principal.process.command_line)\n    $principal_process_file_sha256 = array_distinct($process.principal.process.file.sha256)\n    $principal_process_file_full_path = array_distinct($process.principal.process.file.full_path)\n    $principal_process_product_specfic_process_id = array_distinct($process.principal.process.product_specific_process_id)\n    $principal_process_parent_process_product_specfic_process_id = array_distinct($process.principal.process.parent_process.product_specific_process_id)\n    $target_process_pid = array_distinct($process.target.process.pid)\n    $target_process_command_line = array_distinct($process.target.process.command_line)\n    $target_process_file_sha256 = array_distinct($process.target.process.file.sha256)\n    $target_process_file_full_path = array_distinct($process.target.process.file.full_path)\n    $target_process_product_specfic_process_id = array_distinct($process.target.process.product_specific_process_id)\n    $principal_user_userid = array_distinct($process.principal.user.userid)\n    $target_file_sha256 = array_distinct($process.target.file.sha256)\n    $target_file_full_path = array_distinct($process.target.file.full_path)\n \n  condition:\n    $process and $ioc\n}\n",
  "author": "Google Cloud Security",
  "severity": {
    "displayName": "Medium"
  },
  "metadata": {
    "assumption": "Assumes MISP data has been ingested into entity graph; this rule can be modified to utilize other TI indicators",
    "data_source": "microsoft sysmon",
    "priority": "Medium",
    "description": "Detect file/process events with watchlisted hashes from MISP that VT flagged as MS Office docx file types",
    "type": "alert",
    "tags": "threat indicators, vt enrichment"
  },
  "createTime": "2024-07-15T05:47:46.523215Z",
  "revisionCreateTime": "2024-07-15T05:47:46.523215Z",
  "compilationState": "SUCCEEDED",
  "type": "MULTI_EVENT",
  "allowedRunFrequencies": [
    "LIVE",
    "HOURLY",
    "DAILY"
  ],
  "etag": "CILw0rQGEJjBvvkB",
  "inputsUsed": {
    "usesUdm": true,
    "usesEntity": true
  }
}