{
  "name": "projects/1017425675889/locations/europe-west3/instances/a099fd02-80fc-4a0f-a80c-fb5d7fe78564/rules/ru_c4e6015e-d6e3-4599-a39e-07625692863b",
  "revisionId": "v_1716805622_949343000",
  "displayName": "win_repeatedAuthFailure_thenSuccess_T1110_001",
  "text": "rule win_repeatedAuthFailure_thenSuccess_T1110_001 {\n\n  meta:\n    author = \"Google Cloud Security\"\n    description = \"Detect Multiple Failed Login Attempts followed by Successful Login\"\n    type = \"alert\"\n    data_source = \"microsoft windows events\"\n    platform = \"Windows\"\n    severity = \"Medium\"\n    priority = \"Medium\"\n    mitre_attack_tactic = \"Credential Access\"\n    mitre_attack_technique = \"Brute Force: Password Guessing\"\n    mitre_attack_url = \"https://attack.mitre.org/techniques/T1110/001/\"\n    mitre_attack_version = \"v13.1\"\n\n  events:\n    $fail.metadata.event_type = \"USER_LOGIN\"\n    $fail.metadata.vendor_name = \"Microsoft\"\n    $fail.principal.hostname = $hostname\n    $fail.target.user.userid = $user\n    $fail.security_result.action = \"BLOCK\"\n    $fail.metadata.product_event_type = \"4625\"\n   \n    $fail.metadata.event_timestamp.seconds < $success.metadata.event_timestamp.seconds\n   \n    $success.metadata.event_type = \"USER_LOGIN\"\n    $success.metadata.vendor_name = \"Microsoft\"\n    $success.target.user.userid = $user\n    $success.principal.hostname = $hostname\n    $success.security_result.action = \"ALLOW\"\n    $success.metadata.product_event_type = \"4624\"\n\n  match:\n    $user, $hostname over 15m\n\n  outcome:\n    // increment risk score if the system targeted is active directory server, can modify as you see fit, using this as an example\n    $risk_score = max(if($hostname = /activedir/, 75, 50))\n    $mitre_attack_tactic = \"Credential Access\"\n    $mitre_attack_technique = \"Brute Force: Password Guessing\"\n    $mitre_attack_technique_id = \"T1110.001\"\n    $failed_login_threshold = max(5)\n    $impacted_systems = array_distinct($hostname)\n    $impacted_users = array_distinct($user)\n    $alert_type = \"Successful Brute Force Attack\"\n    $tlp = \"red\"\n    // added to populate alert graph with additional context\n    // Commented out principal.hostname because it is already represented in graph as match variable. If match changes, can uncomment to add to results   \n    //$principal_hostname = array_distinct($success.principal.hostname)\n    $principal_ip = array_distinct($success.principal.ip)\n    $target_hostname = array_distinct($success.target.hostname)\n    $src_hostname = array_distinct($success.src.hostname)\n    $target_ip = array_distinct($success.target.ip)\n    $principal_user_userid = array_distinct($success.principal.user.userid)\n    // Commented out target.user.userid because it is already represented in graph as match variable. If match changes, can uncomment to add to results   \n    //$target_user_userid = array_distinct($success.target.user.userid)\n    $principal_resource_name = array_distinct($success.principal.resource.name)\n    $target_resource_name = array_distinct($success.target.resource.name)\n    $target_url = array_distinct($success.target.url)\n \n  condition:\n    #fail > 4 and $success\n}\n",
  "author": "Google Cloud Security",
  "severity": {
    "displayName": "Medium"
  },
  "metadata": {
    "description": "Detect Multiple Failed Login Attempts followed by Successful Login",
    "data_source": "microsoft windows events",
    "platform": "Windows",
    "mitre_attack_version": "v13.1",
    "type": "alert",
    "mitre_attack_url": "https://attack.mitre.org/techniques/T1110/001/",
    "mitre_attack_technique": "Brute Force: Password Guessing",
    "mitre_attack_tactic": "Credential Access",
    "priority": "Medium"
  },
  "createTime": "2024-05-27T10:27:02.949343Z",
  "revisionCreateTime": "2024-05-27T10:27:02.949343Z",
  "compilationState": "SUCCEEDED",
  "type": "MULTI_EVENT",
  "allowedRunFrequencies": [
    "LIVE",
    "HOURLY",
    "DAILY"
  ],
  "etag": "CPa/0bIGEJim18QD",
  "inputsUsed": {
    "usesUdm": true
  }
}