{
  "name": "projects/1017425675889/locations/europe-west3/instances/a099fd02-80fc-4a0f-a80c-fb5d7fe78564/rules/ru_d655ebfb-0d2f-4282-8dfb-1f3379939027",
  "revisionId": "v_1719125903_482927000",
  "displayName": "rw_windows_password_spray_T1110_003",
  "text": "/*\n * Copyright 2023 Google LLC\n *\n * Licensed under the Apache License, Version 2.0 (the \"License\");\n * you may not use this file except in compliance with the License.\n * You may obtain a copy of the License at\n *\n *     https://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required by applicable law or agreed to in writing, software\n * distributed under the License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n * See the License for the specific language governing permissions and\n * limitations under the License.\n */\n\nrule rw_windows_password_spray_T1110_003 {\n\n  meta:\n    author = \"Google Cloud Security\"\n    description = \"Detect repeated authentication failure with multiple users indicative of a password spray attack.\"\n    type = \"alert\"\n    data_source = \"microsoft windows events\"\n    mitre_attack_tactic = \"Credential Access\"\n    mitre_attack_technique = \"Brute Force: Password Spraying\"\n    mitre_attack_url = \"https://attack.mitre.org/techniques/T1110/003/\"\n    mitre_attack_version = \"v13.1\"\n    platform = \"Windows\"\n    severity = \"Medium\"\n    priority = \"Medium\"\n\n  events:\n    $login.metadata.event_type = \"USER_LOGIN\"\n    $login.metadata.vendor_name = \"Microsoft\"\n    $login.principal.hostname = $hostname\n    $login.target.user.userid = $user\n    $login.security_result.action = \"BLOCK\"\n\n  match:\n    $hostname over 30m\n\n  outcome:\n    $risk_score = max(65)\n    $mitre_attack_tactic = array_distinct(\"Credential Access\")\n    $mitre_attack_technique = array_distinct(\"Brute Force: Password Spraying\")\n    $mitre_attack_technique_id = array_distinct(\"T1110.003\")\n    $event_count = count_distinct($login.metadata.id)\n    $user_login_threshold = max(10)\n    $target_user_distinct_count = count_distinct($user)\n    $target_user_count = count($user)\n    $tlp = array_distinct(\"amber\")\n    // added to populate alert graph with additional context\n    // Commented out principal.hostname because it is already represented in graph as match variable. If match changes, can uncomment to add to results\n    //$principal_hostname = array_distinct($login.principal.hostname)\n    $principal_ip = array_distinct($login.principal.ip)\n    $target_hostname = array_distinct($login.target.hostname)\n    $src_hostname = array_distinct($login.src.hostname)\n    $target_ip = array_distinct($login.target.ip)\n    $principal_user_userid = array_distinct($login.principal.user.userid)\n    $target_user_userid = array_distinct($login.target.user.userid)\n    $principal_resource_name = array_distinct($login.principal.resource.name)\n    $target_resource_name = array_distinct($login.target.resource.name)\n    $target_url = array_distinct($login.target.url)\n\n  condition:\n    #user > 10\n}\n",
  "author": "Google Cloud Security",
  "severity": {
    "displayName": "Medium"
  },
  "metadata": {
    "data_source": "microsoft windows events",
    "platform": "Windows",
    "mitre_attack_url": "https://attack.mitre.org/techniques/T1110/003/",
    "mitre_attack_version": "v13.1",
    "mitre_attack_tactic": "Credential Access",
    "priority": "Medium",
    "type": "alert",
    "description": "Detect repeated authentication failure with multiple users indicative of a password spray attack.",
    "mitre_attack_technique": "Brute Force: Password Spraying"
  },
  "createTime": "2024-06-23T06:58:23.482927Z",
  "revisionCreateTime": "2024-06-23T06:58:23.482927Z",
  "compilationState": "SUCCEEDED",
  "type": "MULTI_EVENT",
  "allowedRunFrequencies": [
    "LIVE",
    "HOURLY",
    "DAILY"
  ],
  "etag": "CI+P37MGEJjDo+YB",
  "inputsUsed": {
    "usesUdm": true
  }
}