{
  "name": "projects/1017425675889/locations/europe-west3/instances/a099fd02-80fc-4a0f-a80c-fb5d7fe78564/rules/ru_f6bc31f5-1157-4dae-aeb7-81e944a0d153",
  "revisionId": "v_1716805556_533807000",
  "displayName": "wmic_ntds_dit_T1003_003_cisa_report",
  "text": "rule wmic_ntds_dit_T1003_003_cisa_report {\n\n  meta:\n    author = \"Google Cloud Security\"\n    description = \"Detects extraction of ntds.dit file using vssadmin.exe or ntdsutil.exe with wmic as identified in CISA Living of the Land pdf\"\n    type = \"alert\"\n    platform = \"Windows\"\n    data_source = \"microsoft sysmon, windows event logs\"\n    mitre_attack_tactic = \"Credential Access\"\n    mitre_attack_technique = \"OS Credential Dumping: NTDS\"\n    mitre_attack_url = \"https://attack.mitre.org/versions/v13/techniques/T1003/003/\"\n    mitre_attack_version = \"v13.1\"\n    reference = \"https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF\"\n    severity = \"High\"\n    priority = \"High\"\n\n  events:\n    (\n        $process.metadata.event_type = \"PROCESS_LAUNCH\" and\n        (\n            // cisa report referenced cmd /c in their report throughout, can filter this in/out for tuning as needed\n            // other wmic switches like /user and /password, these have been excluded to focus on the commands being issued since local access does not require these\n            re.regex($process.target.process.command_line, `(|cmd.*/c).*wmic.*process.*call.*create.*ntdsutil.*create.*full`) nocase or\n            // for greater precision to align with the report, the following line can be used instead of the previous line to focus on specific folders referenced\n            //re.regex($process.target.process.command_line, `(|cmd.*/c).*wmic.*process.*call.*create.*ntdsutil.*create.*full.*windows\\\\temp\\\\(tmp|pro|msafee_logs)`) nocase or\n            re.regex($process.target.process.command_line, `(|cmd.*/c).*vssadmin.*create.*shadow`) nocase or\n            // To detect this without wmic being used but written to c:\\windows\\temp\\ in general\n            re.regex($process.target.process.command_line, `(|cmd.*/c).*ntdsutil.*create.*full.*windows\\\\temp\\\\`) nocase\n        )\n    )\n    or\n    (\n        // This does not detect one of the utilitites responsible for excuting ntdsutil or vssadmin, but does detect .dit file being created in monitored folders\n        $process.metadata.event_type = \"FILE_CREATION\" and\n        re.regex($process.target.file.full_path, `\\.dit$`) nocase\n    )\n    or\n    (\n        //Identify application event log actions associated with the creation of the ntds.dit file and with ntds database\n        $process.metadata.product_name = \"ESENT\" and\n        $process.metadata.vendor_name = \"Microsoft\" and\n        (\n            $process.metadata.product_event_type = \"216\" or\n            $process.metadata.product_event_type = \"325\" or\n            $process.metadata.product_event_type = \"326\" or\n            $process.metadata.product_event_type = \"327\"\n        )\n    )\n    $process.principal.hostname = $hostname\n\n  match:\n    $hostname over 5m\n\n  outcome:\n    $risk_score = max(85)\n    $mitre_attack_tactic = \"Credential Access\"\n    $mitre_attack_technique = \"OS Credential Dumping: NTDS\"\n    $mitre_attack_technique_id = \"T1003.003\"\n    $event_count = count_distinct($process.metadata.id)\n    // added to populate alert graph with additional context\n    // Commented out principal.hostname because it is already represented in graph as match variable. If match changes, can uncomment to add to results\n    //$principal_hostname = array_distinct($process.principal.hostname)\n    $principal_process_pid = array_distinct($process.principal.process.pid)\n    $principal_process_command_line = array_distinct($process.principal.process.command_line)\n    $principal_process_file_sha256 = array_distinct($process.principal.process.file.sha256)\n    $principal_process_file_full_path = array_distinct($process.principal.process.file.full_path)\n    $principal_process_product_specfic_process_id = array_distinct($process.principal.process.product_specific_process_id)\n    $principal_process_parent_process_product_specfic_process_id = array_distinct($process.principal.process.parent_process.product_specific_process_id)\n    $target_process_pid = array_distinct($process.target.process.pid)\n    $target_process_command_line = array_distinct($process.target.process.command_line)\n    $target_process_file_sha256 = array_distinct($process.target.process.file.sha256)\n    $target_process_file_full_path = array_distinct($process.target.process.file.full_path)\n    $target_process_product_specfic_process_id = array_distinct($process.target.process.product_specific_process_id)\n    $principal_user_userid = array_distinct($process.principal.user.userid)\n\n  condition:\n    $process\n}\n",
  "author": "Google Cloud Security",
  "severity": {
    "displayName": "High"
  },
  "metadata": {
    "mitre_attack_url": "https://attack.mitre.org/versions/v13/techniques/T1003/003/",
    "mitre_attack_version": "v13.1",
    "platform": "Windows",
    "type": "alert",
    "data_source": "microsoft sysmon, windows event logs",
    "mitre_attack_technique": "OS Credential Dumping: NTDS",
    "description": "Detects extraction of ntds.dit file using vssadmin.exe or ntdsutil.exe with wmic as identified in CISA Living of the Land pdf",
    "mitre_attack_tactic": "Credential Access",
    "reference": "https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF",
    "priority": "High"
  },
  "createTime": "2024-05-27T10:25:56.533807Z",
  "revisionCreateTime": "2024-05-27T10:25:56.533807Z",
  "compilationState": "SUCCEEDED",
  "type": "SINGLE_EVENT",
  "allowedRunFrequencies": [
    "LIVE",
    "HOURLY",
    "DAILY"
  ],
  "etag": "CLS/0bIGEJj/xP4B",
  "inputsUsed": {
    "usesUdm": true
  }
}